---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDouble
source: html/372eb578-7749-c353-8b08-a75e1ae2f35e.htm
---
# AssetPropertyDouble Members

Adds a new connected asset attached to this asset property, if it allows it.